{
  "architectures": [
    "SiglipModel"
  ],
  "initializer_factor": 1.0,
  "model_type": "siglip",
  "text_config": {
    "hidden_size": 1152,
    "intermediate_size": 4304,
    "model_type": "siglip_text_model",
    "num_attention_heads": 16,
    "num_hidden_layers": 27
  },
  "torch_dtype": "bfloat16",
  "transformers_version": "4.37.0.dev0",
  "vision_config": {
    "hidden_size": 1024,
    "image_size": 384,
    "intermediate_size": 4304,
    "model_type": "siglip_vision_model",
    "num_attention_heads": 16,
    "num_hidden_layers": 27,
    "patch_size": 14,
    "vjepa": {
      "ar_range": [
        0.75,
        1.35
      ],
      "batch_size": 1,
      "betas": [
        0.9,
        0.999
      ],
      "cfgs_mask": [
        {
          "aspect_ratio": [
            0.75,
            1.5
          ],
          "max_keep": null,
          "max_temporal_keep": 1.0,
          "num_blocks": 8,
          "spatial_scale": [
            0.15,
            0.15
          ],
          "temporal_scale": [
            1.0,
            1.0
          ]
        },
        {
          "aspect_ratio": [
            0.75,
            1.5
          ],
          "max_keep": null,
          "max_temporal_keep": 1.0,
          "num_blocks": 2,
          "spatial_scale": [
            0.7,
            0.7
          ],
          "temporal_scale": [
            1.0,
            1.0
          ]
        }
      ],
      "clip_grad": 10.0,
      "crop_size": 384,
      "dataset_paths": [
        "/app/data/kinetics400/train.csv",
        "/app/data/kinetics400/val.csv"
      ],
      "dataset_type": "VideoDataset",
      "datasets_weights": null,
      "decode_one_clip": true,
      "duration": null,
      "ema": [
        0.998,
        1.0
      ],
      "eps": 1e-08,
      "filter_short_videos": false,
      "final_lr": 1e-06,
      "final_wd": 0.4,
      "folder": "/app/output/",
      "frames_per_clip": 16,
      "ipe": 300,
      "ipe_scale": 1.25,
      "load_model": false,
      "log_resource_util_data": false,
      "loss_exp": 1.0,
      "lr": 0.000625,
      "mask_type": "multiblock3d",
      "model_name": "vit_large",
      "motion_shift": false,
      "num_clips": 1,
      "num_epochs": 300,
      "num_frames": 16,
      "num_workers": 2,
      "patch_size": 16,
      "pin_mem": true,
      "pred_depth": 12,
      "pred_embed_dim": 384,
      "r_file": null,
      "reg_coeff": 0.0,
      "reprob": 0.0,
      "rr_scale": [
        0.3,
        1.0
      ],
      "sampling_rate": 4,
      "save_every_freq": -1,
      "seed": 234,
      "skip_batches": -1,
      "start_lr": 0.0002,
      "tag": "jepa",
      "tubelet_size": 2,
      "uniform_power": true,
      "use_aa": false,
      "use_mask_tokens": true,
      "use_sdpa": true,
      "warmup": 40,
      "wd": 0.04,
      "which_dtype": "bfloat16",
      "zero_init_mask_tokens": true
    }
  }
}